class Building {
  String name;
  String imgUrl;
  String desc;

  Building({required this.name, required this.imgUrl, required this.desc});
}

var buildings = [
  Building(
      name: 'أبراج الكويت',
      imgUrl:
          'https://user-images.githubusercontent.com/24327781/188260105-52be6a2e-a6d3-4ceb-86c0-ddc83e0aa5b6.jpeg',
      desc:
          "يتكون من كرة عليا وهي الكرة الكاشفة وتدور دورة كاملة حول نفسها كل نصف ساعة مطلعة الزوار على مناظر الكويت، كما يحتوي البرج على مصعدين سريعين لنقل الزوار من الأرض إلى الكرة الكاشفة على ارتفاع 133 مترا في 35 ثانية. ، ويبلغ قطر البرج عند الأرض 20 متر، ويحتوي البرج على خزان للمياه يتسع لمليون غالون من المياه."),
  Building(
      name: 'برج التحرير',
      imgUrl:
          'https://user-images.githubusercontent.com/24327781/188260123-28de85b4-d272-4ebb-b2ad-22a9582079bf.jpeg',
      desc:
          "ميم والهيكل الخاص ببرج التحرير في الكويت يتميز بالفخامة والعظمة الكبيرة في أساسات البرج وأبعاده. حيث يضم قاعدة بها ثلاثة سراديب، يبلغ عمقها 18 متر تحت مستوى سطح البحر، يشمل مساحة تبلغ 21 ألف متر مربع. كذلك تم تصميم البرج على شكل مبنيين، مبنى سفلي يبلغ ارتفاعه 150 متر"),
  Building(
      name: 'المسجد الكبير',
      imgUrl:
          'https://user-images.githubusercontent.com/24327781/188260137-021d865a-625e-4941-ad75-6427c690e0cf.jpeg',
      desc:
          "مسجد الدولة الكبير هو مسجد يقع في مدينة الكويت قرب شاطئ الخليج العربي اُفتتح عام 1986م بناء على توجيهات من الشيخ جابر الأحمد الصباح. بدأ العمل في بنائه عام 1979 واكتمل عام 1986 وبلغت كلفة إنجازه 14 مليون دينار كويتي وساهم في بنائه خمسون مهندسا وأربعمائة وخمسون عاملا. صمم المسجد المهندس المعماري محمد صالح مكية واختار تصميمه على الطراز الأندلسي الفاخر وتبلغ مساحة المسجد 45 ألف مترا مربعا، منها 25 ألف مترا مربعا مبنية، و 20 ألف مترا مربعا مكشوفة تشكل حدائق وممرات المسجد الخارجية"),
];
